#include "rus.h"
#include <iostream>
#include <windows.h>
#include <string>
#include <ctime>

конст дробн размер = 40;
дробн т=0, пх, пу;
цлчис фпс=0, тт=0;
огромный цлчис след = 0;
строка выв = "";
строка градиент = " .,!/r(l1Z4H9W8$@", градиент1 = " .-,*oO0$";

цлчис получ_тек_итр(дробн х, дробн у);

нчГлавный
    Система("title Фракталы в Консоли"); Система("mode con cols=80 lines=41"); Система("color F0");

    пока (Правда) {
        Система("cls"); 
        выв = "";

        для (цлчис у = 0; у < размер; у++) {
            для (цлчис х = 0; х < размер*2; х++) {
                пх = (х / размер)/2 * 5 - 2.5;
                пу = (у / размер) * 5 - 2.5;
                
                выв += градиент[получ_тек_итр(пх, пу)];
            } выв += кцстр;
        }

        если (таймер() >= след) {
            след = таймер() + 1000;
            фпс = тт;
            тт = 0;
        } тт++;

        консоль доб выв доб кцстр
                доб "точка: " доб син(т)*1.5 доб " " доб -кос(т/1.2) * 1.5 доб "i / FPS: " доб фпс;
        т += 0.07;
    }
кцГлавный

цлчис получ_тек_итр(дробн х, дробн у) {
    дробн а = х, б = у;
    цлчис итр = 0;
    пока (итр < градиент.длина()-1) {
        дробн аа = степ(а, 2), бб = степ(б, 2),
              двааб = 2 * а * б;

        а = аа - бб + син(т)*1.5;
        б = двааб - кос(т/1.2) * 1.5;

        если (кор(степ(а, 2) + степ(б, 2)) > 3) прервать;

        итр++;
    }
    вернуть итр;
}
